chipKIT32/chipKIT-core/pic32/cores/pic32/cpudefs.h
    #elif defined(__32MX360F256L__)
        #define _CPU_NAME_      "32MX360F256L"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX3XX__

    #elif defined(__32MX360F512L__)
        #define _CPU_NAME_      "32MX360F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX3XX__

    #elif defined(__32MX370F512H__)
        #define _CPU_NAME_      "32MX370F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX37X__
        #define __PIC32MX37XH__
        #define __PIC32_PPS__

    #elif defined(__32MX370F512L__)
        #define _CPU_NAME_      "32MX370F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX37X__
        #define __PIC32MX37XL__
        #define __PIC32_PPS__

    //************************************************************************
    //*  MX  400 series

    #elif defined(__32MX420F032H__)
        #define _CPU_NAME_      "32MX420F032H"
        #define FLASHEND        (((32 - 4) * 1024L) - 1)
        #define RAMEND          ((8 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX4XX__

    #elif defined(__32MX440F128H__)
        #define _CPU_NAME_      "32MX440F128H"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX4XX__

    #elif defined(__32MX440F256H__)
        #define _CPU_NAME_      "32MX440F256H"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX4XX__

    #elif defined(__32MX440F512H__)
        #define _CPU_NAME_      "32MX440F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX4XX__

    #elif defined(__32MX440F128L__)
        #define _CPU_NAME_      "32MX440F128L"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX4XX__

    #elif defined(__32MX460F256L__)
        #define _CPU_NAME_      "32MX460F256L"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX4XX__

    #elif defined(__32MX460F512L__)
        #define _CPU_NAME_      "32MX460F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX4XX__

    #elif defined(__32MX470F512H__)
        #define _CPU_NAME_      "32MX470F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32_PPS__
        #define __PIC32MX47X__
        #define __PIC32MX47XH__
    
    #elif defined(__32MX470F512L__)
        #define _CPU_NAME_      "32MX470F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((128 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32_PPS__
        #define __PIC32MX47X__
        #define __PIC32MX47XL__

    //************************************************************************
    //*  MX  500 series

    #elif defined(__32MX534F064H__)
        #define _CPU_NAME_      "32MX534F064H"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX5XX__

    #elif defined(__32MX564F064H__)
        #define _CPU_NAME_      "32MX564F064H"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX5XX__

    #elif defined(__32MX564F128H__)
        #define _CPU_NAME_      "32MX564F128H"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX5XX__

    #elif defined(__32MX575F256H__)
        #define _CPU_NAME_      "32MX575F256H"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX5XX__

    #elif defined(__32MX575F512H__)
        #define _CPU_NAME_      "32MX575F512H"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX5XX__

    #elif defined(__32MX534F064L__)
        #define _CPU_NAME_      "32MX534F064L"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((16 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX5XX__

    #elif defined(__32MX564F064L__)
        #define _CPU_NAME_      "32MX564F064L"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX5XX__

    #elif defined(__32MX564F128L__)
        #define _CPU_NAME_      "32MX564F128L"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX5XX__

    #elif defined(__32MX575F256L__)
        #define _CPU_NAME_      "32MX575F256L"
        #define FLASHEND        (((256 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX5XX__

    #elif defined(__32MX575F512L__)
        #define _CPU_NAME_      "32MX575F512L"
        #define FLASHEND        (((512 - 4) * 1024L) - 1)
        #define RAMEND          ((64 * 1024L) - 1)
        #define __PIC32_PINS__  100
        #define __PIC32MX5XX__

    //************************************************************************
    //*  MX  600 series

    #elif defined(__32MX664F064H__)
        #define _CPU_NAME_      "32MX664F064H"
        #define FLASHEND        (((64 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX6XX__

    #elif defined(__32MX664F128H__)
        #define _CPU_NAME_      "32MX664F128H"
        #define FLASHEND        (((128 - 4) * 1024L) - 1)
        #define RAMEND          ((32 * 1024L) - 1)
        #define __PIC32_PINS__  64
        #define __PIC32MX6XX__

