chipKIT32/chipKIT-core/pic32/cores/pic32/cpudefs.h
    #elif defined(__32MZ2048EFM064__)
        #define _CPU_NAME_      "32MZ2048EFM064"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  64
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFM100__)
        #define _CPU_NAME_      "32MZ2048EFM100"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  100
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFM124__)
        #define _CPU_NAME_      "32MZ2048EFM124"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  124
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2048EFM144__)
        #define _CPU_NAME_      "32MZ2048EFM144"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((512 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  144
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    //***************************************
    //* MZ    DA series

    //* 169 pin LFBGA parts
    //* No DDR interface

    #elif defined(__32MZ1025DAA169__)
        #define _CPU_NAME_      "32MZ1025DAA169"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ1025DAB169__)
        #define _CPU_NAME_      "32MZ1025DAB169"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__

    #elif defined(__32MZ1064DAA169__)
        #define _CPU_NAME_      "32MZ1064DAA169"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ1064DAB169__)
        #define _CPU_NAME_      "32MZ1064DAB169"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__

    #elif defined(__32MZ2025DAA169__)
        #define _CPU_NAME_      "32MZ2025DAA169"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2025DAB169__)
        #define _CPU_NAME_      "32MZ2025DAB169"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__

    #elif defined(__32MZ2064DAA169__)
        #define _CPU_NAME_      "32MZ2064DAA169"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__

    #elif defined(__32MZ2064DAB169__)
        #define _CPU_NAME_      "32MZ2064DAB169"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__

    //* 32MB Internal DDR

    #elif defined(__32MZ1025DAG169__)
        #define _CPU_NAME_      "32MZ1025DAG169"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_DDR_INTERNAL__
        #define __DDR_SIZE__    (32 * 1024 * 1024)

    #elif defined(__32MZ1025DAH169__)
        #define _CPU_NAME_      "32MZ1025DAH169"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__
        #define __HAS_DDR_INTERNAL__
        #define __DDR_SIZE__    (32 * 1024 * 1024)

    #elif defined(__32MZ1064DAG169__)
        #define _CPU_NAME_      "32MZ1064DAG169"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_DDR_INTERNAL__
        #define __DDR_SIZE__    (32 * 1024 * 1024)

    #elif defined(__32MZ1064DAH169__)
        #define _CPU_NAME_      "32MZ1064DAH169"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__
        #define __HAS_DDR_INTERNAL__
        #define __DDR_SIZE__    (32 * 1024 * 1024)

    #elif defined(__32MZ2025DAG169__)
        #define _CPU_NAME_      "32MZ2025DAG169"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_DDR_INTERNAL__
        #define __DDR_SIZE__    (32 * 1024 * 1024)

    #elif defined(__32MZ2025DAH169__)
        #define _CPU_NAME_      "32MZ2025DAH169"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__
        #define __HAS_DDR_INTERNAL__
        #define __DDR_SIZE__    (32 * 1024 * 1024)

    #elif defined(__32MZ2064DAG169__)
        #define _CPU_NAME_      "32MZ2064DAG169"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_DDR_INTERNAL__
        #define __DDR_SIZE__    (32 * 1024 * 1024)

    #elif defined(__32MZ2064DAH169__)
        #define _CPU_NAME_      "32MZ2064DAH169"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  169
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__
        #define __HAS_DDR_INTERNAL__
        #define __DDR_SIZE__    (32 * 1024 * 1024)

    //* 176 pin LQFP parts

