chipKIT32/chipKIT-core/pic32/cores/pic32/cpudefs.h
    #elif defined(__32MZ1025DAB288__)
        #define _CPU_NAME_      "32MZ1025DAB288"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  288
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__
        #define __HAS_DDR_EXTERNAL__

    #elif defined(__32MZ1064DAA288__)
        #define _CPU_NAME_      "32MZ1064DAA288"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  288
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_DDR_EXTERNAL__

    #elif defined(__32MZ1064DAB288__)
        #define _CPU_NAME_      "32MZ1064DAB288"
        #define FLASHEND        (((1024 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  288
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__
        #define __HAS_DDR_EXTERNAL__

    #elif defined(__32MZ2025DAA288__)
        #define _CPU_NAME_      "32MZ2025DAA288"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  288
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_DDR_EXTERNAL__

    #elif defined(__32MZ2025DAB288__)
        #define _CPU_NAME_      "32MZ2025DAB288"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((256 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  288
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__
        #define __HAS_DDR_EXTERNAL__

    #elif defined(__32MZ2064DAA288__)
        #define _CPU_NAME_      "32MZ2064DAA288"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  288
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_DDR_EXTERNAL__

    #elif defined(__32MZ2064DAB288__)
        #define _CPU_NAME_      "32MZ2064DAB288"
        #define FLASHEND        (((2048 - 4) * 1024L) - 1)
        #define RAMEND          ((640 * 1024L) - 1)
        #define __PIC32_PPS__
        #define __PIC32_PINS__  288
        #define __PIC32MZXX__
        #define __PIC32MZEFADC__
        #define __HAS_CRYPTO__
        #define __HAS_DDR_EXTERNAL__


    #else
        #error CPU type is unknown, cpudefs.h needs to have additions
    #endif
#endif //defined(__PIC32MX__) || defined(__PIC32MZ__)

// Set up MZ ADC type   
#if defined(__PIC32MZ__)
    // do we have EF or EC ADCs
    #ifndef __PIC32MZEFADC__
        #define __PIC32MZECADC__
    #endif
#endif

//Fix issue 213
#ifndef __PIC32_PPS__
  #define OPT_BOARD_INTERNAL
#endif

//************************************************************************
#ifndef _CPU_NAME_
    #define _CPU_NAME_    "Unknown"
#endif
